Zeh868/Bmelod/portable/vendor/stm32g4/bm_vendor_usart3_stm32g4.c
/* SPDX-License-Identifier: GPL-3.0-or-later */
/**
 * @file bm_vendor_usart3_stm32g4.c
 * @brief STM32G4 USART3 设备实例驱动（IDLE + DMA TX/RX）
 *
 * App 通过 `bm_usart3_stm32g4_config_t` 指定端口/Pin/AF/DMA/IRQ；Bmelod 不固定
 * USART3 与具体产品引脚。
 *
 * 设计要点：
 * - TX/RX GPIO 端口、引脚、AF 全部由配置指定，后端不写死 GPIOB。
 * - TX/RX DMA 控制器（DMA1/DMA2）与通道号全部由配置指定；IRQ 经
 *   `bm_dma_irq_stm32g4` 路由器注册，运行时改通道无需再导出 Handler。
 * - RX 使用 DMA 循环模式 + 软件读指针：IDLE/RX_FULL 交付完整帧事件；HT 仅
 *   维护写指针与溢出检测，不标 FRAME_END（避免长帧半缓冲误拆）。
 * - TX 使用 DMA 正常模式，DMA TC 后开启 USART TC 中断，在 USART TC 到达时才
 *   触发发送完成回调，确保最后一个停止位已离开发送器。
 * - TX DMA TE：停 DMA、清 TC IT、结束 TX 会话并调用 tx_complete_cb，供 RS485
 *   等上层立即退出发送态。
 * - 回调统一传递真实的 `bm_hal_uart_t *dev` 指针，不把 context 强转成设备。
 * - init 对引脚、DMA、IRQ、波特率/数据位/校验/停止位做合法性校验；失败时回滚
 *   已配置的 NVIC/时钟。kernel_clock_hz==0 时假定 USART 时钟=PCLK1。
 *
 * @author zeh (china_qzh@163.com)
 * @version 3.3
 * @date 2026-07-28
 *
 * @par 修改日志:
 *
 *    Date         Version        Author          Description
 * 2026-07-28       1.0            zeh            新增 STM32G4 USART3 后端
 * 2026-07-28       2.0            zeh            支持任意端口/DMA 控制器/通道；
 *                                                重写环形 RX 与两段式 TX 完成
 * 2026-07-28       3.0            zeh            DMA IRQ handler 按配置条件定义；
 *                                                validate 改纯算术校验（不读 BRR）；
 *                                                DMA TC 标志修正为 TCIF(+1)，RX ISR
 *                                                补 TEIF 检查，DMA TE 改记 OVERRUN
 * 2026-07-28       3.1            zeh            DMA IRQ 改路由器注册；TX TE 结束
 *                                                会话并回调上层
 * 2026-07-28       3.2            zeh            HT 不再交付 FRAME_END；支持
 *                                                kernel_clock_hz
 * 2026-07-29       3.3            zeh            RX 环形缓冲改用单调 produced/consumed
 *                                                计数，消除整圈丢失风险
 */
#include "bm_vendor_usart3_stm32g4.h"
#include "bm_dma_irq_stm32g4.h"
#include "bm_dma_circular_ring.h"
#include "bm_hal_instances_stm32g4.h"
#include "bm/common/bm_types.h"

#include <stddef.h>
#include <stdint.h>
#include <string.h>

#include "stm32g4xx.h"
#include "stm32g4xx_ll_bus.h"
#include "stm32g4xx_ll_dma.h"
#include "stm32g4xx_ll_gpio.h"
#include "stm32g4xx_ll_dmamux.h"
#include "stm32g4xx_ll_rcc.h"
#include "stm32g4xx_ll_usart.h"

/** @brief 默认 USART3 配置（PB10/PB11，DMA1_CH4/CH5，115200 8N1）。 */
static const bm_usart3_stm32g4_config_t g_usart3_cfg_default = {
    .baud = BM_STM32G4_USART3_BAUD,
    .parity = BM_UART_PARITY_NONE,
    .stop_bits = BM_UART_STOPBITS_1,
    .data_bits = BM_UART_DATABITS_8,
    .kernel_clock_hz = 0u,
    .tx_port = BM_STM32G4_USART3_TX_PORT,
    .tx_pin = BM_STM32G4_USART3_TX_PIN,
    .rx_port = BM_STM32G4_USART3_RX_PORT,
    .rx_pin = BM_STM32G4_USART3_RX_PIN,
    .gpio_af = BM_STM32G4_USART3_GPIO_AF,
    .tx_dma_ctrl = BM_STM32G4_USART3_TX_DMA_CTRL,
    .tx_dma_ch = BM_STM32G4_USART3_TX_DMA_CH,
    .tx_dma_req = BM_STM32G4_USART3_TX_DMA_REQ,
    .rx_dma_ctrl = BM_STM32G4_USART3_RX_DMA_CTRL,
    .rx_dma_ch = BM_STM32G4_USART3_RX_DMA_CH,
    .rx_dma_req = BM_STM32G4_USART3_RX_DMA_REQ,
    .usart_irqn = USART3_IRQn,
    .tx_dma_irqn = DMA1_Channel4_IRQn,
    .rx_dma_irqn = DMA1_Channel5_IRQn,
    .irq_priority = BM_STM32G4_USART3_IRQ_PRIORITY,
    .tx_dma_irq_priority = BM_STM32G4_USART3_TX_DMA_IRQ_PRIORITY,
    .rx_dma_irq_priority = BM_STM32G4_USART3_RX_DMA_IRQ_PRIORITY,
};

/** @brief 运行时上下文。 */
typedef struct {
    const bm_hal_uart_t              *dev;
    const bm_usart3_stm32g4_config_t *cfg;
    int                                initialized;
    int                                tx_busy;

    uint8_t                           *rx_buf;
    size_t                             rx_len;
    bm_dma_circ_ring_t                 rx_ring;      /**< DMA 循环接收记账 */

    bm_uart_tx_complete_callback_t     tx_complete_cb;
    void                              *tx_complete_user;
    bm_uart_rx_frame_callback_t        rx_frame_cb;
    void                              *rx_frame_user;

    bm_uart_stats_t                    stats;
} bm_usart3_context_t;

static bm_usart3_context_t g_usart3_ctx;

/* -------------------------------------------------------------------------- */
/*  底层辅助                                                                   */
/* -------------------------------------------------------------------------- */

/**
 * @brief 由端口编码取 GPIO 寄存器指针。
 */
static GPIO_TypeDef *bm_usart3_port(uint32_t port) {
    switch (port) {
    case 0u: return GPIOA;
    case 1u: return GPIOB;
    case 2u: return GPIOC;
    case 3u: return GPIOD;
    case 4u: return GPIOE;
    case 5u: return GPIOF;
    case 6u: return GPIOG;
    default: return NULL;
    }
}

/**
 * @brief 由 DMA 控制器号取 DMA 寄存器指针。
 */
static DMA_TypeDef *bm_usart3_dma_ctrl(uint32_t ctrl) {
    return (ctrl == 2u) ? DMA2 : DMA1;
}

/**
 * @brief 使能指定 GPIO 端口时钟。
 */
static void bm_usart3_gpio_clock_enable(uint32_t port) {
    switch (port) {
    case 0u: LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_GPIOA); break;
    case 1u: LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_GPIOB); break;
    case 2u: LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_GPIOC); break;
    case 3u: LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_GPIOD); break;
    case 4u: LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_GPIOE); break;
    case 5u: LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_GPIOF); break;
    case 6u: LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_GPIOG); break;
    default: break;
    }
}

/**
 * @brief 使能指定 DMA 控制器时钟。
 */
static void bm_usart3_dma_clock_enable(uint32_t ctrl) {
    if (ctrl == 1u) {
        LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_DMA1);
    } else if (ctrl == 2u) {
        LL_AHB1_GRP1_EnableClock(LL_AHB1_GRP1_PERIPH_DMA2);
    }
}

/**
 * @brief GPIO 复用配置（推挽、高速、无上下拉）。
 */
static void bm_usart3_gpio_af(GPIO_TypeDef *port, uint32_t pin, uint32_t af) {
    uint32_t pin_mask = 1u << pin;

    LL_GPIO_SetPinMode(port, pin_mask, LL_GPIO_MODE_ALTERNATE);
    LL_GPIO_SetPinSpeed(port, pin_mask, LL_GPIO_SPEED_FREQ_HIGH);
    LL_GPIO_SetPinPull(port, pin_mask, LL_GPIO_PULL_NO);
    if (pin < 8u) {
        LL_GPIO_SetAFPin_0_7(port, pin_mask, af);
    } else {
        LL_GPIO_SetAFPin_8_15(port, pin_mask, af);
    }
}

/**
 * @brief 配置 TX DMA 通道（正常模式）。
 */
static void bm_usart3_tx_dma_config(const bm_usart3_context_t *ctx,
                                    DMA_TypeDef *dma, uint32_t ch,
                                    const uint8_t *data, size_t len) {
    (void)ctx;

