Zeh868/Bmelod/portable/vendor/stm32g4/bm_vendor_usart3_stm32g4.c
    LL_DMA_DisableChannel(dma, ch);
    LL_DMA_SetPeriphAddress(dma, ch, (uint32_t)&USART3->TDR);
    LL_DMA_SetMemoryAddress(dma, ch, (uint32_t)data);
    LL_DMA_SetDataLength(dma, ch, (uint32_t)len);
    LL_DMA_SetMode(dma, ch, LL_DMA_MODE_NORMAL);
    LL_DMA_SetPeriphIncMode(dma, ch, LL_DMA_PERIPH_NOINCREMENT);
    LL_DMA_SetMemoryIncMode(dma, ch, LL_DMA_MEMORY_INCREMENT);
    LL_DMA_SetPeriphSize(dma, ch, LL_DMA_PDATAALIGN_BYTE);
    LL_DMA_SetMemorySize(dma, ch, LL_DMA_MDATAALIGN_BYTE);
    LL_DMA_SetDataTransferDirection(dma, ch, LL_DMA_DIRECTION_MEMORY_TO_PERIPH);
    LL_DMA_SetChannelPriorityLevel(dma, ch, LL_DMA_PRIORITY_MEDIUM);
}

/**
 * @brief 配置 RX DMA 通道（循环模式）。
 */
static void bm_usart3_rx_dma_config(const bm_usart3_context_t *ctx,
                                    DMA_TypeDef *dma, uint32_t ch) {
    LL_DMA_DisableChannel(dma, ch);
    LL_DMA_SetPeriphAddress(dma, ch, (uint32_t)&USART3->RDR);
    LL_DMA_SetMemoryAddress(dma, ch, (uint32_t)ctx->rx_buf);
    LL_DMA_SetDataLength(dma, ch, (uint32_t)ctx->rx_len);
    LL_DMA_SetMode(dma, ch, LL_DMA_MODE_CIRCULAR);
    LL_DMA_SetPeriphIncMode(dma, ch, LL_DMA_PERIPH_NOINCREMENT);
    LL_DMA_SetMemoryIncMode(dma, ch, LL_DMA_MEMORY_INCREMENT);
    LL_DMA_SetPeriphSize(dma, ch, LL_DMA_PDATAALIGN_BYTE);
    LL_DMA_SetMemorySize(dma, ch, LL_DMA_MDATAALIGN_BYTE);
    LL_DMA_SetDataTransferDirection(dma, ch, LL_DMA_DIRECTION_PERIPH_TO_MEMORY);
    LL_DMA_SetChannelPriorityLevel(dma, ch, LL_DMA_PRIORITY_MEDIUM);
}

/**
 * @brief 启动 RX DMA 循环接收，并复位软件读/写指针。
 */
static void bm_usart3_rx_dma_start(bm_usart3_context_t *ctx) {
    DMA_TypeDef *dma;
    uint32_t ch;

    if (ctx->rx_buf == NULL || ctx->rx_len == 0u) {
        return;
    }
    if (ctx->cfg->rx_dma_ctrl < 1u || ctx->cfg->rx_dma_ctrl > 2u ||
        ctx->cfg->rx_dma_ch < 1u || ctx->cfg->rx_dma_ch > 7u) {
        return;
    }

    dma = bm_usart3_dma_ctrl(ctx->cfg->rx_dma_ctrl);
    ch = ctx->cfg->rx_dma_ch;

    bm_dma_circ_ring_reset(&ctx->rx_ring, ctx->rx_buf,
                           (uint32_t)ctx->rx_len);

    bm_usart3_rx_dma_config(ctx, dma, ch);
    LL_DMA_EnableIT_TC(dma, ch);
    LL_DMA_EnableIT_HT(dma, ch);
    LL_DMA_EnableChannel(dma, ch);
    LL_USART_EnableDMAReq_RX(USART3);
}

/**
 * @brief 停止 RX DMA。
 */
static void bm_usart3_rx_dma_stop(bm_usart3_context_t *ctx) {
    DMA_TypeDef *dma;
    uint32_t ch;

    if (ctx->cfg == NULL) {
        return;
    }
    dma = bm_usart3_dma_ctrl(ctx->cfg->rx_dma_ctrl);
    ch = ctx->cfg->rx_dma_ch;
    LL_DMA_DisableChannel(dma, ch);
    LL_USART_DisableDMAReq_RX(USART3);
}

/**
 * @brief 停止 TX DMA。
 */
static void bm_usart3_tx_dma_stop(bm_usart3_context_t *ctx) {
    DMA_TypeDef *dma;
    uint32_t ch;

    if (ctx->cfg == NULL) {
        return;
    }
    dma = bm_usart3_dma_ctrl(ctx->cfg->tx_dma_ctrl);
    ch = ctx->cfg->tx_dma_ch;
    LL_DMA_DisableChannel(dma, ch);
    LL_USART_DisableDMAReq_TX(USART3);
}

/**
 * @brief 更新 RX 写指针与溢出统计；可选通知上层帧事件。
 *
 * 使用单调 produced/consumed 计数，避免 DMA 接收整圈时 write_pos == read_pos
 * 被误判为"无数据"。
 *
 * @param ctx    运行时上下文
 * @param event  本次事件标志（notify=0 时可传 0）
 * @param notify 非零：在有未读数据时调用 rx_frame_cb；HT 须传 0，避免半缓冲误拆帧
 */
static void bm_usart3_rx_update(bm_usart3_context_t *ctx, uint32_t event,
                                int notify) {
    DMA_TypeDef *dma;
    uint32_t ch;
    uint32_t ndtr;
    uint32_t new_bytes;
    uint32_t free_space;
    uint32_t pending;

    if (ctx->rx_buf == NULL || ctx->rx_len == 0u) {
        return;
    }

    dma = bm_usart3_dma_ctrl(ctx->cfg->rx_dma_ctrl);
    ch = ctx->cfg->rx_dma_ch;
    ndtr = LL_DMA_GetDataLength(dma, ch);
    if (ndtr > ctx->rx_len) {
        ndtr = (uint32_t)ctx->rx_len;
    }

    free_space = bm_dma_circ_ring_free_space(&ctx->rx_ring);
    new_bytes = bm_dma_circ_ring_update(&ctx->rx_ring, ndtr);
    if (new_bytes > free_space) {
        /* 软件读取不及时导致覆盖：丢弃全部已缓冲数据 */
        ctx->stats.rx_overflow_count++;
        ctx->stats.last_errors |= BM_UART_ERR_OVERFLOW;
        bm_dma_circ_ring_drop_all(&ctx->rx_ring);
    }

    pending = bm_dma_circ_ring_pending(&ctx->rx_ring);
    ctx->stats.rx_count += new_bytes;

    if (notify != 0 && ctx->rx_frame_cb != NULL && pending > 0u) {
        ctx->rx_frame_cb(ctx->dev, event, (size_t)pending, ctx->rx_frame_user);
    }
}

/**
 * @brief 更新 USART 错误统计并清除标志。
 */
static void bm_usart3_update_errors(bm_usart3_context_t *ctx) {
    uint32_t isr = USART3->ISR;
    uint32_t errs = 0u;

    if ((isr & USART_ISR_ORE) != 0u) {
        errs |= BM_UART_ERR_OVERRUN;
        ctx->stats.rx_overrun_count++;
        LL_USART_ClearFlag_ORE(USART3);
    }
    if ((isr & USART_ISR_FE) != 0u) {
        errs |= BM_UART_ERR_FRAMING;
        ctx->stats.rx_framing_count++;
        LL_USART_ClearFlag_FE(USART3);
    }
    if ((isr & USART_ISR_PE) != 0u) {
        errs |= BM_UART_ERR_PARITY;
        ctx->stats.rx_parity_count++;
        LL_USART_ClearFlag_PE(USART3);
    }
    if ((isr & USART_ISR_NE) != 0u) {
        errs |= BM_UART_ERR_NOISE;
        ctx->stats.rx_noise_count++;
        LL_USART_ClearFlag_NE(USART3);
    }
    if (errs != 0u) {
        ctx->stats.last_errors |= errs;
    }
}

/**
 * @brief 反初始化：关闭 NVIC 中断、DMA、USART，并注销 DMA 路由。
 */
static void bm_usart3_hw_deinit(bm_usart3_context_t *ctx) {
    if (ctx->cfg == NULL) {
        return;
    }

    NVIC_DisableIRQ(ctx->cfg->usart_irqn);
    NVIC_DisableIRQ(ctx->cfg->tx_dma_irqn);
    NVIC_DisableIRQ(ctx->cfg->rx_dma_irqn);

    bm_dma_irq_unregister((uint8_t)ctx->cfg->tx_dma_ctrl,
                          (uint8_t)ctx->cfg->tx_dma_ch);
    if (ctx->cfg->rx_dma_ctrl != ctx->cfg->tx_dma_ctrl ||
        ctx->cfg->rx_dma_ch != ctx->cfg->tx_dma_ch) {
        bm_dma_irq_unregister((uint8_t)ctx->cfg->rx_dma_ctrl,
                              (uint8_t)ctx->cfg->rx_dma_ch);
    }

    LL_USART_DisableIT_TC(USART3);
    LL_USART_DisableIT_IDLE(USART3);
    LL_USART_Disable(USART3);

    bm_usart3_tx_dma_stop(ctx);
    bm_usart3_rx_dma_stop(ctx);
}

/* -------------------------------------------------------------------------- */
/*  配置校验                                                                   */
/* -------------------------------------------------------------------------- */

/**
 * @brief 解析 USART 内核时钟：配置非零优先，否则取 PCLK1。
 */
static uint32_t bm_usart3_kernel_hz(const bm_usart3_stm32g4_config_t *cfg) {
    LL_RCC_ClocksTypeDef clocks;

    if (cfg != NULL && cfg->kernel_clock_hz != 0u) {
        return cfg->kernel_clock_hz;
    }
    LL_RCC_GetSystemClocksFreq(&clocks);
    return clocks.PCLK1_Frequency;
}

/**
 * @brief 校验串口参数配置是否合法。
 */
static int bm_usart3_validate_config(const bm_usart3_stm32g4_config_t *cfg) {
    uint32_t ker_hz;

