Zeh868/Bmelod/portable/vendor/stm32g4/bm_vendor_usart3_stm32g4.c
    if (cfg == NULL) {
        return BM_ERR_INVALID;
    }
    if (cfg->baud == 0u) {
        return BM_ERR_INVALID;
    }
    if (cfg->tx_port > 6u || cfg->tx_pin > 15u ||
        cfg->rx_port > 6u || cfg->rx_pin > 15u) {
        return BM_ERR_INVALID;
    }
    if (cfg->gpio_af > 15u) {
        return BM_ERR_INVALID;
    }
    if (cfg->tx_dma_ctrl < 1u || cfg->tx_dma_ctrl > 2u ||
        cfg->tx_dma_ch < 1u || cfg->tx_dma_ch > 7u ||
        cfg->rx_dma_ctrl < 1u || cfg->rx_dma_ctrl > 2u ||
        cfg->rx_dma_ch < 1u || cfg->rx_dma_ch > 7u) {
        return BM_ERR_INVALID;
    }
    /* DMAMUX 请求号由 App 按 RM0440 表填写；范围 0..127 */
    if (cfg->tx_dma_req > 127u || cfg->rx_dma_req > 127u) {
        return BM_ERR_INVALID;
    }
    if (cfg->parity != BM_UART_PARITY_NONE &&
        cfg->parity != BM_UART_PARITY_EVEN &&
        cfg->parity != BM_UART_PARITY_ODD) {
        return BM_ERR_INVALID;
    }
    if (cfg->stop_bits != BM_UART_STOPBITS_1 &&
        cfg->stop_bits != BM_UART_STOPBITS_2) {
        return BM_ERR_INVALID;
    }
    if (cfg->data_bits != BM_UART_DATABITS_8 &&
        cfg->data_bits != BM_UART_DATABITS_9) {
        return BM_ERR_INVALID;
    }

    /* 纯算术校验波特率可达性：OVERSAMPLING_16 要求 USARTDIV = ker/baud >= 16。
     * 不得在此读 LL_USART_GetBaudRate——validate 先于时钟使能与 SetBaudRate
     * 执行，BRR 复位值为 0 会导致恒定误判；硬件回读检查保留在 init 中。 */
    ker_hz = bm_usart3_kernel_hz(cfg);
    if ((ker_hz / 16u) < cfg->baud) {
        return BM_ERR_INVALID;
    }

    return BM_OK;
}

/* -------------------------------------------------------------------------- */
/*  ISR                                                                       */
/* -------------------------------------------------------------------------- */

/**
 * @brief USART3 全局中断：错误、IDLE、TX 完成。
 */
void USART3_IRQHandler(void) {
    bm_usart3_context_t *ctx = &g_usart3_ctx;
    uint32_t isr;

    if (ctx->cfg == NULL || !ctx->initialized) {
        return;
    }

    isr = USART3->ISR;
    bm_usart3_update_errors(ctx);

    if ((isr & USART_ISR_IDLE) != 0u) {
        LL_USART_ClearFlag_IDLE(USART3);
        bm_usart3_rx_update(ctx, BM_UART_EVT_IDLE, 1);
    }

    if ((isr & USART_ISR_TC) != 0u) {
        LL_USART_ClearFlag_TC(USART3);
        LL_USART_DisableIT_TC(USART3);
        ctx->tx_busy = 0;
        if (ctx->tx_complete_cb != NULL) {
            ctx->tx_complete_cb(ctx->dev, ctx->tx_complete_user);
        }
    }
}

/**
 * @brief 通用 TX DMA 中断处理。
 */
static void bm_usart3_tx_dma_isr(bm_usart3_context_t *ctx) {
    DMA_TypeDef *dma = bm_usart3_dma_ctrl(ctx->cfg->tx_dma_ctrl);
    uint32_t ch = ctx->cfg->tx_dma_ch;
    /* DMA_ISR 布局：GIF(+0)/TCIF(+1)/HTIF(+2)/TEIF(+3)，每通道 4bit
     * （stm32g474xx.h:3219-3228，对照 SPI 后端 BM_VENDOR_DMA_TC_FLAG） */
    uint32_t tc_flag = (2u << ((ch - 1u) * 4u));
    uint32_t te_flag = (1u << ((ch - 1u) * 4u + 3u));

    if ((dma->ISR & te_flag) != 0u) {
        /* 传输错误：停止 DMA，结束 TX 会话并通知上层（RS485 等须立即退出发送） */
        dma->IFCR = te_flag;
        LL_DMA_DisableChannel(dma, ch);
        LL_USART_DisableDMAReq_TX(USART3);
        LL_USART_DisableIT_TC(USART3);
        LL_USART_ClearFlag_TC(USART3);
        ctx->tx_busy = 0;
        ctx->stats.last_errors |= BM_UART_ERR_OVERRUN;
        if (ctx->tx_complete_cb != NULL && ctx->dev != NULL) {
            ctx->tx_complete_cb(ctx->dev, ctx->tx_complete_user);
        }
        return;
    }

    if ((dma->ISR & tc_flag) != 0u) {
        dma->IFCR = tc_flag;
        LL_DMA_DisableChannel(dma, ch);
        LL_USART_DisableDMAReq_TX(USART3);
        /* DMA 完成并不表示 UART TC；开启 USART TC 中断等待真正发送完成 */
        LL_USART_ClearFlag_TC(USART3);
        LL_USART_EnableIT_TC(USART3);
    }
}

/**
 * @brief 通用 RX DMA 中断处理（HT/TC）。
 */
static void bm_usart3_rx_dma_isr(bm_usart3_context_t *ctx) {
    DMA_TypeDef *dma = bm_usart3_dma_ctrl(ctx->cfg->rx_dma_ctrl);
    uint32_t ch = ctx->cfg->rx_dma_ch;
    uint32_t tc_flag = (2u << ((ch - 1u) * 4u));
    uint32_t ht_flag = (1u << ((ch - 1u) * 4u + 2u));
    uint32_t te_flag = (1u << ((ch - 1u) * 4u + 3u));

    if ((dma->ISR & te_flag) != 0u) {
        /* DMA 传输错误（总线错误）：上报并清标志，数据视为不可靠 */
        dma->IFCR = te_flag;
        ctx->stats.last_errors |= BM_UART_ERR_OVERRUN;
    }
    if ((dma->ISR & ht_flag) != 0u) {
        dma->IFCR = ht_flag;
        /* HT 仅推进写指针/溢出检测，不交付帧（避免长帧在半缓冲处被误拆） */
        bm_usart3_rx_update(ctx, 0u, 0);
    }
    if ((dma->ISR & tc_flag) != 0u) {
        dma->IFCR = tc_flag;
        /* TC 表示完整一圈已完成；先推进 produced 到下一周期边界，
         * 再 update 读取当前 NDTR，避免整圈数据被漏计。 */
        bm_dma_circ_ring_mark_full_round(&ctx->rx_ring);
        bm_usart3_rx_update(ctx, BM_UART_EVT_RX_FULL, 1);
    }
}

/**
 * @brief 按通道号调用对应 DMA handler。
 */
static void bm_usart3_dma_dispatch(bm_usart3_context_t *ctx,
                                   uint32_t ctrl, uint32_t ch) {
    if (ctx->cfg == NULL || !ctx->initialized) {
        return;
    }

    if (ctrl == ctx->cfg->tx_dma_ctrl && ch == ctx->cfg->tx_dma_ch) {
        bm_usart3_tx_dma_isr(ctx);
    }
    if (ctrl == ctx->cfg->rx_dma_ctrl && ch == ctx->cfg->rx_dma_ch) {
        bm_usart3_rx_dma_isr(ctx);
    }
}

/**
 * @brief TX DMA 路由入口（由 bm_dma_irq_stm32g4 调用）。
 */
static void bm_usart3_dma_tx_entry(void *user) {
    bm_usart3_context_t *ctx = (bm_usart3_context_t *)user;

    if (ctx == NULL || ctx->cfg == NULL) {
        return;
    }
    bm_usart3_dma_dispatch(ctx, ctx->cfg->tx_dma_ctrl, ctx->cfg->tx_dma_ch);
}

/**
 * @brief RX DMA 路由入口（由 bm_dma_irq_stm32g4 调用）。
 */
static void bm_usart3_dma_rx_entry(void *user) {
    bm_usart3_context_t *ctx = (bm_usart3_context_t *)user;

    if (ctx == NULL || ctx->cfg == NULL) {
        return;
    }
    bm_usart3_dma_dispatch(ctx, ctx->cfg->rx_dma_ctrl, ctx->cfg->rx_dma_ch);
}

/* -------------------------------------------------------------------------- */
/*  HAL API 实现                                                               */
/* -------------------------------------------------------------------------- */

static int bm_vendor_usart3_init(const struct bm_hal_uart *dev, void *config) {
    bm_usart3_context_t *ctx = &g_usart3_ctx;
    const bm_usart3_stm32g4_config_t *runtime_cfg =
        (const bm_usart3_stm32g4_config_t *)config;
    const bm_usart3_stm32g4_config_t *cfg;
    GPIO_TypeDef *tx_port, *rx_port;
    DMA_TypeDef *tx_dma, *rx_dma;
    uint32_t parity_ll;
    uint32_t stop_ll;
    uint32_t data_bits;
    uint32_t actual_baud;

    cfg = (runtime_cfg != NULL) ? runtime_cfg : &g_usart3_cfg_default;

    if (bm_usart3_validate_config(cfg) != BM_OK) {
        return BM_ERR_INVALID;
    }

    tx_port = bm_usart3_port(cfg->tx_port);
    rx_port = bm_usart3_port(cfg->rx_port);
    tx_dma = bm_usart3_dma_ctrl(cfg->tx_dma_ctrl);
    rx_dma = bm_usart3_dma_ctrl(cfg->rx_dma_ctrl);
    if (tx_port == NULL || rx_port == NULL || tx_dma == NULL || rx_dma == NULL) {
        return BM_ERR_INVALID;
    }

