Zeh868/Bmelod/portable/vendor/stm32g4/bm_vendor_usart3_stm32g4.c
    /* 先清状态，再初始化；失败时回滚 */
    ctx->dev = dev;
    ctx->cfg = cfg;
    ctx->initialized = 0;
    ctx->tx_busy = 0;
    ctx->rx_buf = NULL;
    ctx->rx_len = 0u;
    bm_dma_circ_ring_reset(&ctx->rx_ring, NULL, 0u);
    ctx->tx_complete_cb = NULL;
    ctx->tx_complete_user = NULL;
    ctx->rx_frame_cb = NULL;
    ctx->rx_frame_user = NULL;
    (void)memset(&ctx->stats, 0, sizeof(ctx->stats));

    /* 使能时钟 */
    LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_USART3);
    bm_usart3_dma_clock_enable(cfg->tx_dma_ctrl);
    if (cfg->rx_dma_ctrl != cfg->tx_dma_ctrl) {
        bm_usart3_dma_clock_enable(cfg->rx_dma_ctrl);
    }
    bm_usart3_gpio_clock_enable(cfg->tx_port);
    if (cfg->rx_port != cfg->tx_port) {
        bm_usart3_gpio_clock_enable(cfg->rx_port);
    }

    /* 配置 GPIO */
    bm_usart3_gpio_af(tx_port, cfg->tx_pin, cfg->gpio_af);
    bm_usart3_gpio_af(rx_port, cfg->rx_pin, cfg->gpio_af);

    /* DMAMUX 请求映射 */
    LL_DMA_SetPeriphRequest(tx_dma, cfg->tx_dma_ch, cfg->tx_dma_req);
    LL_DMA_SetPeriphRequest(rx_dma, cfg->rx_dma_ch, cfg->rx_dma_req);

    LL_USART_Disable(USART3);

    switch (cfg->parity) {
    case BM_UART_PARITY_EVEN:
        parity_ll = LL_USART_PARITY_EVEN;
        break;
    case BM_UART_PARITY_ODD:
        parity_ll = LL_USART_PARITY_ODD;
        break;
    default:
        parity_ll = LL_USART_PARITY_NONE;
        break;
    }

    stop_ll = (cfg->stop_bits == BM_UART_STOPBITS_2)
                  ? LL_USART_STOPBITS_2
                  : LL_USART_STOPBITS_1;

    data_bits = (cfg->data_bits == BM_UART_DATABITS_9) ? 9u : 8u;

    {
        uint32_t ker_hz = bm_usart3_kernel_hz(cfg);

        LL_USART_SetBaudRate(USART3, ker_hz,
                             LL_USART_PRESCALER_DIV1,
                             LL_USART_OVERSAMPLING_16,
                             cfg->baud);
        actual_baud = LL_USART_GetBaudRate(USART3, ker_hz,
                                           LL_USART_PRESCALER_DIV1,
                                           LL_USART_OVERSAMPLING_16);
    }
    if (actual_baud == 0u) {
        bm_usart3_hw_deinit(ctx);
        ctx->cfg = NULL;
        return BM_ERR_INVALID;
    }

    LL_USART_ConfigAsyncMode(USART3);
    LL_USART_SetDataWidth(USART3,
        (data_bits == 9u) ? LL_USART_DATAWIDTH_9B : LL_USART_DATAWIDTH_8B);
    LL_USART_SetParity(USART3, parity_ll);
    LL_USART_SetStopBitsLength(USART3, stop_ll);
    LL_USART_SetTransferDirection(USART3, LL_USART_DIRECTION_TX_RX);

    LL_USART_EnableIT_IDLE(USART3);
    LL_USART_ClearFlag_IDLE(USART3);

    /* DMA 向量由统一路由器持有；失败则回滚，避免与 SPI 等争用同一通道 */
    if (bm_dma_irq_register((uint8_t)cfg->tx_dma_ctrl, (uint8_t)cfg->tx_dma_ch,
                            bm_usart3_dma_tx_entry, ctx) != BM_OK) {
        bm_usart3_hw_deinit(ctx);
        ctx->cfg = NULL;
        return BM_ERR_BUSY;
    }
    if (cfg->rx_dma_ctrl != cfg->tx_dma_ctrl ||
        cfg->rx_dma_ch != cfg->tx_dma_ch) {
        if (bm_dma_irq_register((uint8_t)cfg->rx_dma_ctrl,
                                (uint8_t)cfg->rx_dma_ch,
                                bm_usart3_dma_rx_entry, ctx) != BM_OK) {
            bm_usart3_hw_deinit(ctx);
            ctx->cfg = NULL;
            return BM_ERR_BUSY;
        }
    }

    NVIC_SetPriority(cfg->usart_irqn, cfg->irq_priority);
    NVIC_EnableIRQ(cfg->usart_irqn);
    NVIC_SetPriority(cfg->tx_dma_irqn, cfg->tx_dma_irq_priority);
    NVIC_EnableIRQ(cfg->tx_dma_irqn);
    NVIC_SetPriority(cfg->rx_dma_irqn, cfg->rx_dma_irq_priority);
    NVIC_EnableIRQ(cfg->rx_dma_irqn);

    LL_USART_Enable(USART3);

    ctx->initialized = 1;
    return BM_OK;
}

static int bm_vendor_usart3_send(const struct bm_hal_uart *dev,
                                 const uint8_t *data, size_t len) {
    bm_usart3_context_t *ctx = &g_usart3_ctx;
    DMA_TypeDef *dma;
    uint32_t ch;

    (void)dev;
    if (ctx->initialized == 0 || data == NULL || len == 0u) {
        return BM_ERR_INVALID;
    }
    if (ctx->tx_busy != 0) {
        return BM_ERR_BUSY;
    }

    dma = bm_usart3_dma_ctrl(ctx->cfg->tx_dma_ctrl);
    ch = ctx->cfg->tx_dma_ch;

    ctx->tx_busy = 1;
    ctx->stats.tx_count += (uint32_t)len;

    bm_usart3_tx_dma_config(ctx, dma, ch, data, len);
    LL_DMA_EnableIT_TC(dma, ch);
    LL_DMA_EnableIT_TE(dma, ch);
    LL_DMA_EnableChannel(dma, ch);

    LL_USART_ClearFlag_TC(USART3);
    LL_USART_EnableDMAReq_TX(USART3);
    return BM_OK;
}

static size_t bm_vendor_usart3_recv(const struct bm_hal_uart *dev,
                                    uint8_t *data, size_t max_len) {
    bm_usart3_context_t *ctx = &g_usart3_ctx;
    uint32_t copied;

    (void)dev;
    if (ctx->initialized == 0 || data == NULL || max_len == 0u ||
        ctx->rx_buf == NULL || ctx->rx_len == 0u) {
        return 0u;
    }

    /* 同步一次写位置，确保读取的是最新数据 */
    bm_usart3_rx_update(ctx, 0u, 0);

    copied = bm_dma_circ_ring_consume(&ctx->rx_ring, data, (uint32_t)max_len);
    return (size_t)copied;
}

static void bm_vendor_usart3_set_rx_callback(const struct bm_hal_uart *dev,
                                             void (*cb)(uint8_t c)) {
    (void)dev;
    (void)cb;
    /* 本后端不支持单字节回调；上层应使用 set_rx_frame_callback */
}

static int bm_vendor_usart3_abort(const struct bm_hal_uart *dev) {
    bm_usart3_context_t *ctx = &g_usart3_ctx;

    (void)dev;
    if (ctx->initialized == 0) {
        return BM_ERR_NOT_INIT;
    }

    bm_usart3_tx_dma_stop(ctx);
    LL_USART_DisableIT_TC(USART3);
    ctx->tx_busy = 0;

    bm_usart3_rx_dma_stop(ctx);
    bm_dma_circ_ring_reset(&ctx->rx_ring, ctx->rx_buf,
                           (uint32_t)ctx->rx_len);
    return BM_OK;
}

static int bm_vendor_usart3_flush(const struct bm_hal_uart *dev) {
    bm_usart3_context_t *ctx = &g_usart3_ctx;
    uint32_t timeout = 100000u;

    (void)dev;
    if (ctx->initialized == 0) {
        return BM_ERR_NOT_INIT;
    }

    /* 等待 tx_busy 释放（USART TC 中断中清零） */
    while (ctx->tx_busy != 0 && timeout != 0u) {
        timeout--;
    }
    return (ctx->tx_busy == 0) ? BM_OK : BM_ERR_TIMEOUT;
}

static int bm_vendor_usart3_set_tx_complete_callback(
    const struct bm_hal_uart *dev,
    bm_uart_tx_complete_callback_t cb, void *user) {
    bm_usart3_context_t *ctx = &g_usart3_ctx;

    (void)dev;
    if (ctx->initialized == 0) {
        return BM_ERR_NOT_INIT;
    }
    ctx->tx_complete_cb = cb;
    ctx->tx_complete_user = user;
    return BM_OK;
}

