Zeh868/Bmelod/portable/vendor/stm32g4/bm_vendor_usart3_stm32g4.c
static int bm_vendor_usart3_set_rx_frame_callback(
    const struct bm_hal_uart *dev,
    bm_uart_rx_frame_callback_t cb, void *user) {
    bm_usart3_context_t *ctx = &g_usart3_ctx;

    (void)dev;
    if (ctx->initialized == 0) {
        return BM_ERR_NOT_INIT;
    }
    ctx->rx_frame_cb = cb;
    ctx->rx_frame_user = user;
    return BM_OK;
}

static int bm_vendor_usart3_set_rx_buffer(const struct bm_hal_uart *dev,
                                          uint8_t *buf, size_t len) {
    bm_usart3_context_t *ctx = &g_usart3_ctx;

    (void)dev;
    if (ctx->initialized == 0) {
        return BM_ERR_NOT_INIT;
    }

    bm_usart3_rx_dma_stop(ctx);

    if (buf == NULL || len == 0u) {
        ctx->rx_buf = NULL;
        ctx->rx_len = 0u;
        bm_dma_circ_ring_reset(&ctx->rx_ring, NULL, 0u);
        return BM_ERR_INVALID;
    }

    ctx->rx_buf = buf;
    ctx->rx_len = len;
    bm_usart3_rx_dma_start(ctx);
    return BM_OK;
}

static int bm_vendor_usart3_get_stats(const struct bm_hal_uart *dev,
                                      bm_uart_stats_t *stats) {
    bm_usart3_context_t *ctx = &g_usart3_ctx;

    (void)dev;
    if (ctx->initialized == 0 || stats == NULL) {
        return BM_ERR_INVALID;
    }
    *stats = ctx->stats;
    ctx->stats.last_errors = 0u;
    return BM_OK;
}

static const struct bm_uart_driver_api g_usart3_api = {
    bm_vendor_usart3_init,
    bm_vendor_usart3_send,
    bm_vendor_usart3_recv,
    bm_vendor_usart3_set_rx_callback,
    bm_vendor_usart3_abort,
    bm_vendor_usart3_flush,
    bm_vendor_usart3_set_tx_complete_callback,
    bm_vendor_usart3_set_rx_frame_callback,
    bm_vendor_usart3_set_rx_buffer,
    bm_vendor_usart3_get_stats,
};

const bm_hal_uart_t bm_stm32g4_usart3 = { &g_usart3_api,
                                          &g_usart3_cfg_default };
